app/controllers/admin_users_controller.rb

SELECT  "admin_users".* FROM "admin_users" WHERE "admin_users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def show
		@admin_user = AdminUser.find(params[:id])

INSERT INTO "admin_users" ("year", "first_name", "last_name", "section", "roll_number", "email", "user_mobile", "father", "father_occupation", "father_mobile", "mother", "mother_occupation", "mother_mobile", "interests", "goals", "skills", "strengths", "weaknesses", "username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
		@admin_user = AdminUser.new(admin_user_params)
		@admin_user.user_mobile = "NA"
		@admin_user.father = "NA"
		@admin_user.father_occupation = "NA"
		@admin_user.father_mobile = "NA"
		@admin_user.mother = "NA"
		@admin_user.mother_occupation = "NA"
		@admin_user.mother_mobile = "NA"
		@admin_user.interests = "NA"
		@admin_user.goals = "NA"
		@admin_user.skills = "NA"
		@admin_user.strengths = "NA"
		@admin_user.weaknesses = "NA"
		if @admin_user.save

SELECT  "admin_users".* FROM "admin_users" WHERE "admin_users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def edit
		@admin_user = AdminUser.find(params[:id])

SELECT  "admin_users".* FROM "admin_users" WHERE "admin_users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "admin_users" SET "year" = ?, "section" = ?, "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "admin_users"."id" = ?  [["year", 0], ["section", "NA"], ["email", "NA"], ["password_digest", "$2a$10$GhI5sEO.UlgcmV.vWX/4lOea1/k.h5DOXSBv1xeXsNLsYAY/XAzDa"], ["updated_at", 2017-03-04 17:03:00 UTC], ["id", 1]]
---
	def update
		@admin_user = AdminUser.find(params[:id])
		if @admin_user.update_attributes(admin_user_params)

SELECT  "admin_users".* FROM "admin_users" WHERE "admin_users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def delete
		@admin_user = AdminUser.find(params[:id])

SELECT  "admin_users".* FROM "admin_users" WHERE "admin_users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "admin_users" WHERE "admin_users"."id" = ?  [["id", 3]]
---
	def destroy
		@admin_user = AdminUser.find(params[:id])
		@admin_user.destroy

SELECT "admin_users".* FROM "admin_users"
---
	def reset
		users = AdminUser.all