app/controllers/exams_controller.rb

  def index
    user = AdminUser.find(session[:user_id])
    questions = Question.ids.map(&:to_s)
    answers = user.answered.split
    difference = questions - answers
    if difference.size != 0
      @question = Question.find(difference[rand(0...(difference.size))])
      new_answered = user.answered + @question.id.to_s + " "
      if (user.score == -1)
        user.update_attribute(:created_at, Time.now)
---
SELECT  "admin_users".* FROM "admin_users" WHERE "admin_users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "questions".* FROM "questions" ORDER BY "questions"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "admin_users" SET "score" = ?, "created_at" = ?, "answered" = ?, "updated_at" = ? WHERE "admin_users"."id" = ?  [["score", 0], ["created_at", 2017-03-04 04:55:15 UTC], ["answered", "5 "], ["updated_at", 2017-03-04 04:55:15 UTC], ["id", 2]]

  def show
    user = AdminUser.find(session[:user_id])
    if (question = Question.find(params[:question_id]))
      if params[:answer] == question.answer
        score = user.score + 1
        user.update_attribute(:score, score)
---
SELECT  "admin_users".* FROM "admin_users" WHERE "admin_users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "admin_users" SET "answered" = ?, "score" = ?, "updated_at" = ? WHERE "admin_users"."id" = ?  [["answered", " 2"], ["score", 1], ["updated_at", 2017-03-03 13:02:33 UTC], ["id", 2]]