app/controllers/questions_controller.rb

  def index
    @questions = Question.all.sorted
---
SELECT "questions".* FROM "questions" ORDER BY id DESC

  def show
    @question = Question.find(params[:id])
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def create
    @question = Question.new(:description=> params[:question][:description], :answer => params[:question][:answer], :one => params[:question][:one], :two => params[:question][:two], :three => params[:question][:three])
    if @question.save
---
INSERT INTO "questions" ("description", "answer", "one", "two", "three", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["description", "kya naam h"], ["answer", "bat"], ["one", "rat"], ["two", "cat"], ["three", "mat"], ["created_at", 2017-03-03 10:09:46 UTC], ["updated_at", 2017-03-03 10:09:46 UTC]]

  def edit
    @question = Question.find(params[:id])
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @question = Question.find(params[:id])
    if @question.update_attributes(question_params)
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "questions" SET "three" = ?, "updated_at" = ? WHERE "questions"."id" = ?  [["three", "matsd"], ["updated_at", 2017-03-03 11:35:05 UTC], ["id", 1]]

  def delete
    @question = Question.find(params[:id])
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy
    @question = Question.find(params[:id])
    @question.destroy
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "questions" WHERE "questions"."id" = ?  [["id", 1]]